src/DataProcessors/МониторRAC.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>МониторRAC</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/зд_АктуальнаяПлатформа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>зд_АктуальнаяПлатформа</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Платформа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.здПлатформы1С</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ксКластеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ксКластеры</Name>
			<Comment>DEV-12001</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>host</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>port</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>expirationTimeout</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>lifetimeLimit</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>maxMemorySize</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>maxMemoryTimeLimit</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>securityLevel</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>sessionFaultToleranceLevel</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>loadBalancingMode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>errorsCountThreshold</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>killProblemProcesses</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>killByMemoryWithDump</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Кластер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>cluster</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/МониторRAC/Forms/ФормаМониторСеансов/Ext/Form/Module.bsl
//Элементы.Список.СписокВыбора.Добавить("ксПроцессы","процессы");
//Элементы.Список.СписокВыбора.Добавить("ксСоединения","соединения");
//Элементы.Список.СписокВыбора.Добавить("ксСеансы","сеансы");
	


&НаКлиенте
Процедура ПолучитьДанные(Команда)
	СформироватьСписокНаКлиенте(Список);
КонецПроцедуры 

&НаКлиенте
Процедура СформироватьСписокНаКлиенте(list)
	
	ТаблицаСеансов.Очистить();
	
	мПараметры = СформироватьСтруктуруЗапроса();

	СтруктураДанныхОтвета = ПолучитьСписок(мПараметры,list);
	
	Для Каждого Строка Из СтруктураДанныхОтвета.Результат Цикл
		НоваяСтрока = ТаблицаСеансов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
			НоваяСтрока.infobasename = ИмяИнформационнойБазы(Строка.infobase);
			НоваяСтрока.session = Новый УникальныйИдентификатор(Строка.session);
			НоваяСтрока.infobase = Новый УникальныйИдентификатор(Строка.infobase);
			НоваяСтрока.process = Новый УникальныйИдентификатор(Строка.process);		
			Если Строка.appId = "1CV8C" Тогда
				НоваяСтрока.appId = "Тонкий клиент";
			ИначеЕсли  Строка.appId = "BackgroundJob" Тогда
				НоваяСтрока.appId = "Фоновое задание"; 
			ИначеЕсли Строка.appId = "WebClient" Тогда
				НоваяСтрока.appId = "Веб-клиент";
			ИначеЕсли Строка.appId = "HTTPServiceConnection" Тогда
				НоваяСтрока.appId = "Соединение с HTTP-сервисом";
			ИначеЕсли Строка.appId = "SrvrConsole" Тогда
				НоваяСтрока.appId = "Консоль кластера"; 				 
			ИначеЕсли Строка.appId = "Designer" Тогда
				НоваяСтрока.appId = "Конфигуратор";  
			ИначеЕсли Строка.appId = "1CV8" Тогда
				НоваяСтрока.appId = "Толстый клиент";
			КонецЕсли;
			НоваяСтрока.startedAt = xmlЗначение(тип("дата"), Строка.startedAt);
			НоваяСтрока.lastActiveAt = xmlЗначение(тип("дата"), Строка.lastActiveAt);
			Если Строка.hibernate = "yes" Тогда
				НоваяСтрока.hibernate = Истина; 
			Иначе
				НоваяСтрока.hibernate = Ложь; 
			КонецЕсли;
			//Если ТекСтрока.dbProcInfo <> "" Тогда
			//	МЗ = РегистрыСведений.ксСеансыSQL.СоздатьМенеджерЗаписи(); 				
			//	ЗаполнитьЗначенияСвойств(МЗ,ТекСтрока); 
			//	НоваяСтрока.session = Новый УникальныйИдентификатор(ТекСтрока.session);
			//	НоваяСтрока.infobase = Новый УникальныйИдентификатор(ТекСтрока.infobase);
			//	НоваяСтрока.process = Новый УникальныйИдентификатор(ТекСтрока.process);
			//	НоваяСтрока.dbProcInfo = Число(СтрЗаменить(ТекСтрока.dbProcInfo,Символ(34),""));
			//	Если ТекСтрока.appId = "1CV8C" Тогда
			//		НоваяСтрока.appId = "Тонкий клиент";
			//	ИначеЕсли  ТекСтрока.appId = "BackgroundJob" Тогда
			//		НоваяСтрока.appId = "Фоновое задание"; 
			//	ИначеЕсли ТекСтрока.appId = "WebClient" Тогда
			//		НоваяСтрока.appId = "Веб-клиент";
			//	ИначеЕсли ТекСтрока.appId = "HTTPServiceConnection" Тогда
			//		НоваяСтрока.appId = "Соединение с HTTP-сервисом";
			//	ИначеЕсли ТекСтрока.appId = "SrvrConsole" Тогда
			//		НоваяСтрока.appId = "Консоль кластера"; 				 
			//	ИначеЕсли ТекСтрока.appId = "Designer" Тогда
			//		НоваяСтрока.appId = "Конфигуратор";  
			//	ИначеЕсли ТекСтрока.appId = "1CV8" Тогда
			//		НоваяСтрока.appId = "Толстый клиент";
			//	КонецЕсли;
			//    НоваяСтрока.startedAt = xmlЗначение(тип("дата"), ТекСтрока.startedAt);
			//	НоваяСтрока.lastActiveAt = xmlЗначение(тип("дата"), ТекСтрока.lastActiveAt);
			//	Если ТекСтрока.hibernate = "yes" Тогда
			//		НоваяСтрока.hibernate = Истина; 
			//	Иначе
			//		НоваяСтрока.hibernate = Ложь; 
			//	КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Функция ИмяИнформационнойБазы(infobase)
	
	Результат = "";
	НайденныеСтроки = ИнформационныеБазы.НайтиСтроки(Новый Структура("infobase",infobase));
	Если НайденныеСтроки.Количество() Тогда
		Результат = НайденныеСтроки[0].name;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьТаблицуКластеров();
	СоздатьТаблицыДанных();
	УпралениеФормой();
	
	Список="ксСеансы";
	
КонецПроцедуры

// Временно.
Процедура УпралениеФормой()
	 Элементы.ТаблицаСеансовsession.Видимость = Ложь;
	 Элементы.ТаблицаСеансовinfobase.Видимость = Ложь;
	 Элементы.ТаблицаСеансовprocess.Видимость = Ложь;
	 Элементы.Переместить(Элементы.ТаблицаСеансовdbProcTookAt,Элементы.ТаблицаСеансовdbProcTookAt.Родитель,Элементы.ТаблицаСеансовlocale);
	 Элементы.Переместить(Элементы.ТаблицаСеансовdbProcTook,Элементы.ТаблицаСеансовdbProcTook.Родитель,Элементы.ТаблицаСеансовdbProcTookAt);
КонецПроцедуры

Процедура ЗаполнитьСписокИБ(мПараметры)
	
	Элементы.ИнформационнаяБаза.СписокВыбора.Очистить();
	ИнформационныеБазы.Очистить();
	
	Ковычка = Символ(34); 
	ТекПлатформа = РегистрыСведений.зд_АктуальнаяПлатформа.ПолучитьПоследнее(ТекущаяДата()).Платформа;			
	СтрокаПлатформа = Ковычка+ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекПлатформа,"ПутьКRAC")+Ковычка; 
	СтрокаКластера = Новый УникальныйИдентификатор(мПараметры.cluster); 
	
	
	МассивКластер = СтрРазделить(мПараметры.key, ":", Ложь);
	Сервер = МассивКластер[0]; 	                              
	Порт = МассивКластер[1];
	
	Для Каждого ИБ Из МодульRAC.ПолучитьТаблицуИнформационныхБазНаСервере(СтрокаПлатформа,Сервер,СтрокаКластера,Порт) Цикл
		Элементы.ИнформационнаяБаза.СписокВыбора.Добавить(ИБ.infobase,ИБ.name);
		ЗаполнитьЗначенияСвойств(ИнформационныеБазы.Добавить(),ИБ);
	КонецЦикла;
	
	Элементы.ИнформационнаяБаза.СписокВыбора.СортироватьПоПредставлению();
	
КонецПроцедуры

Процедура СоздатьТаблицыДанных()
	
	ИмяТаблицы = "ТаблицаСеансов";
	
	МассивДобавляемыхЭлементов = новый Массив;
	
	Для Каждого Ресурс Из Метаданные.РегистрыСведений.ксСеансы.Ресурсы Цикл
		ДобавляемыеРеквизиты = Новый Массив; 
		НовыйРеквизит = Новый РеквизитФормы(Ресурс.Имя, Ресурс.Тип, ИмяТаблицы, Ресурс.Синоним, Ложь);
		МассивДобавляемыхЭлементов.Добавить(НовыйРеквизит);
	КонецЦикла;
	
	ЭтаФорма.ИзменитьРеквизиты(МассивДобавляемыхЭлементов);
	
	Для Каждого Реквизит Из МассивДобавляемыхЭлементов Цикл
		НовыйЭлемент = Элементы.Добавить(ИмяТаблицы + Реквизит.Имя, Тип("Полеформы"), Элементы[ИмяТаблицы]);
		// TO DO
		//	Если Колонка.ТипСтрокой="Булево" Или  Колонка.ТипСтрокой="Boolean"Тогда
		//		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		//	Иначе
		//		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		//		НовыйЭлемент.Высота = 0;
		//		НовыйЭлемент.Ширина = Колонка.Ширина;                
		//	КонецЕсли;
			НовыйЭлемент.ТолькоПросмотр = Истина;   
		//	НовыйЭлемент.Заголовок = Колонка.Заголовок;
		//	НовыйЭлемент.Подсказка = "";
			НовыйЭлемент.ПутьКДанным = ИмяТаблицы + "." + Реквизит.Имя;
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуКластеров()
	
	ТаблицаКластеров.Очистить();
	Элементы.Кластер.СписокВыбора.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ксКластеры.cluster КАК cluster,
		|	ксКластеры.host КАК host,
		|	ксКластеры.port КАК port,
		|	ксКластеры.name КАК name,
		|	ксКластеры.Кластер КАК key
		|ИЗ
		|	РегистрСведений.ксКластеры КАК ксКластеры";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Строка = ТаблицаКластеров.Добавить();
		ЗаполнитьЗначенияСвойств(Строка,ВыборкаДетальныеЗаписи);
		
		Элементы.Кластер.СписокВыбора.Добавить(ВыборкаДетальныеЗаписи.key);
		
	КонецЦикла;

КонецПроцедуры 

&НаКлиенте
Функция СформироватьСтруктуруЗапроса()
	
	НайденныеСтроки = ТаблицаКластеров.НайтиСтроки(Новый Структура("key",Кластер));
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		ТекущиеДанные = Неопределено;
	Иначе
		ТекущиеДанные = НайденныеСтроки[0];
	КонецЕсли;
	
	
	мПараметры = новый Структура();
	//мПараметры.Вставить("ПутьКИсполняемомуФайлуRAC",ПутьКИсполняемомуФайлуRAC);
	//мПараметры.Вставить("КодировкаТекстаФайла",КодировкаТекстаФайла);
	Если НЕ ТекущиеДанные=Неопределено Тогда
		мПараметры.Вставить("host",ТекущиеДанные.host);
		мПараметры.Вставить("port",ТекущиеДанные.port);
		мПараметры.Вставить("cluster",ТекущиеДанные.cluster);
	//	мПараметры.Вставить("cluster_user",ТекущиеДанные.cluster_user);
	//	мПараметры.Вставить("cluster_pwd",ТекущиеДанные.cluster_pwd);
	//	cluster = ТекущиеДанные.cluster;
	Иначе
		мПараметры.Вставить("host","");
		мПараметры.Вставить("port",1541);
		мПараметры.Вставить("cluster","");
	//	мПараметры.Вставить("cluster_user","");
	//	мПараметры.Вставить("cluster_pwd","");
	//	cluster = "";
	КонецЕсли;
	
	мПараметры.Вставить("key", ТекущиеДанные.key);

	Возврат мПараметры;

КонецФункции

&НаКлиенте
Процедура ПерейтиКПервойСтроке(Команда)
	Если ТаблицаСеансов.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	Элементы.ТаблицаСеансов.ТекущаяСтрока = ТаблицаСеансов[0].ПолучитьИдентификатор();
КонецПроцедуры 

&НаКлиенте
Процедура СортироватьТаблицуДанных(ИмяКолонки,Направление="Возр")
	
	Если ИмяКолонки="" Тогда
		Элемент = Элементы.ТаблицаСеансов.ТекущийЭлемент;
		Если Элемент=Неопределено Тогда
			Возврат;
		КонецЕсли;
		ИмяКолонки = СтрЗаменить(Элемент.Имя,"ТаблицаСеансов","");
		ИмяКолонкиСортировки = ИмяКолонки+" "+Направление;
	КонецЕсли;
	
	Попытка
		ТаблицаСеансов.Сортировать(ИмяКолонкиСортировки);
	Исключение
		// сбросим если нет сортировки
		ИмяКолонкиСортировки = "";
	КонецПопытки;
		
КонецПроцедуры


&НаКлиенте
Процедура СортироватьПоУбыванию(Команда)
	СортироватьТаблицуДанных("","Убыв");
КонецПроцедуры


&НаКлиенте
Процедура СортироватьПоВозрастанию(Команда)
	СортироватьТаблицуДанных("","Возр");
КонецПроцедуры


&НаКлиенте
Процедура ПерейтиКПоследнейСтроке(Команда)
	Если ТаблицаСеансов.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	Элементы.ТаблицаСеансов.ТекущаяСтрока = ТаблицаСеансов[ТаблицаСеансов.Количество()-1].ПолучитьИдентификатор();
КонецПроцедуры     


&НаСервере
Функция ПолучитьСоответсвиеСинонимовСвойств()
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	Возврат РеквизитОбъект.ПолучитьПолноеСоответствиеСвойств();
КонецФункции 

&НаКлиенте
Процедура УстановитьУровеньПроблемыСтроки(стр,ЭтоТаблица=Истина)
	
	decision = "";  	
	
	Если ЭтоТаблица И стр.func="" Тогда
		
		Источник = новый Структура("list,name,value,func,decision");
		Источник.list = Список;
		ЗаполнитьЗначенияСвойств(Источник,стр);
		// max
		Источник.func = "max";
		УстановитьУровеньПроблемыСтроки(Источник);
		// min
		Источник.func = "min";
		УстановитьУровеньПроблемыСтроки(Источник);
		стр.decision = Источник.decision;
		
		Возврат;
	
	КонецЕсли;
	
	//Ключ = стр.list+"->"+стр.name+"("+стр.func+")";
	//мОтбор = новый Структура("key",Ключ);
	//
	//н_строки = ТаблицаСуждений.НайтиСтроки(мОтбор);
	//
	//Если н_строки.Количество()=0 Тогда
	//	Возврат;
	//КонецЕсли;  	
	//
	//СтрокаСуждения = н_строки[0];
	//
	//Если СтрокаСуждения.invert=Ложь Тогда 
	//	Если стр.value>СтрокаСуждения.attention_from Тогда
	//		decision="красный";
	//	ИначеЕсли стр.value>СтрокаСуждения.warning_from Тогда
	//		decision="желтый";
	//	КонецЕсли;		
	//Иначе
	//	Если стр.value<СтрокаСуждения.attention_to Тогда
	//		decision="красный";
	//	ИначеЕсли стр.value<СтрокаСуждения.warning_to Тогда
	//		decision="желтый";
	//	КонецЕсли;		
	//КонецЕсли;
	//
	//Если стр.decision="" Тогда
	//	стр.decision = decision;
	//ИначеЕсли стр.decision="желтый" И decision="красный" Тогда
	//	стр.decision = decision;
	//КонецЕсли;	
	
КонецПроцедуры


&НаСервере
Процедура УстановитьУсловноеОформлениеТаблицыДанных(Колонки,list)
	
	ИмяПоляУсловие = "";
	ИмяПоляОформление = "";
	ЭтоИстория = ""; // ?(Элементы.КартинкаИстория.Видимость,"история","");
	
	Для каждого стр из Колонки Цикл
	
		Если стр.Ключ="decision" Тогда
			
			ИмяПоляОформление = "ТаблицаСеансов"+стр.ИмяКолонки;
			ИмяПоляУсловие = "ТаблицаСеансов."+стр.ИмяКолонки;
			
			// желтый
			УстановитьОформлениеПоля("decision_желтый1_"+list+ЭтоИстория,"желтый", "ТаблицаСеансов", ИмяПоляУсловие,WebЦвета.Золотой);
//			УстановитьОформлениеПоля("decision_желтый2_"+list+ЭтоИстория,"желтый", ИмяПоляОформление, ИмяПоляУсловие,WebЦвета.Желтый);
		
			// красное
			УстановитьОформлениеПоля("decision_красный1_"+list+ЭтоИстория,"красный", "ТаблицаСеансов", ИмяПоляУсловие,WebЦвета.СветлоРозовый);
//			УстановитьОформлениеПоля("decision_красный2_"+list+ЭтоИстория,"красный", ИмяПоляОформление, ИмяПоляУсловие,WebЦвета.Розовый);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеПоля(Знач Представление, Знач ЗначениеСравенения, Знач ИмяПоляОформление, Знач ИмяПоляУсловие,Знач ЦветФона)

	// проверим наличие офорления
	ЕстьОформление = Ложь;
	
	Для каждого стр из УсловноеОформление.Элементы Цикл
		Если стр.Представление=Представление Тогда
				ЕстьОформление = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьОформление=Истина Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементОформления  = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Представление = Представление;
	ЭлементОформления.Поля.Элементы.Очистить(); 
	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяПоляОформление);
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоляУсловие);// имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение = ЗначениеСравенения;
	ЭлементОтбора.Использование = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
	
	ЭлементОформления.Использование = Истина;
КонецПроцедуры 

&НаКлиенте
Процедура ПолучитьНастройкиКолонокТекущегоСписка(Знач Колонки,Знач list)
	
	Перем мНастройка;
	Перем Ключ;
	// Получим настройки
	Ключ = Строка("МониторRAS.Форма");
	мНастройка = ПолучитьНастройки(Ключ, List);

	Если мНастройка=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Колонки=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиКолонки = мНастройка.Форма.Получить(list);
	
	Если НастройкиКолонки=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеКолонок = новый Соответствие();
	
	Для каждого стр из Колонки Цикл
		СоответствиеКолонок.Вставить(стр.Ключ,стр);
	КонецЦикла;
	
	Для каждого стр из НастройкиКолонки.Колонки Цикл
		Колонка = СоответствиеКолонок.Получить(стр.Ключ);
		Если Колонка=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Колонка.Видимость = стр.Видимость;
	КонецЦикла;
		
КонецПроцедуры  

&НаКлиенте
Функция СоставКолонокОдинаковый(Колонки1,Колонки2)
	
	КолонкиРавны = Истина;
	
	Если Колонки1.Количество()<>Колонки2.Количество() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СоответствиеКолонок1 = новый Соответствие();
	
	Для каждого стр из Колонки1 Цикл
		СоответствиеКолонок1.Вставить(стр.ИмяКолонки, стр);
	КонецЦикла;
		
	
	Для каждого стр из Колонки2 Цикл
		
		элем = СоответствиеКолонок1.Получить(стр.ИмяКолонки);
		
		Если элем=Неопределено Тогда
			КолонкиРавны = Ложь;
			Прервать;
		КонецЕсли;
		
		Если НЕ (элем.Заголовок=стр.Заголовок И элем.ТипСтрокой=стр.ТипСтрокой) Тогда
			КолонкиРавны = Ложь;
			Прервать;
		КонецЕсли;		
		
	КонецЦикла;

	
	Возврат КолонкиРавны;
	
КонецФункции 

//&НаКлиенте
//Процедура ЗаполнитьТаблицуСвойств(Знач МассивСоответствиеДанных,Знач list)
//	
//	Перем стр, стр_н;
//	
//	ТаблицаСвойств.Очистить();
//	
//	Для каждого стр из МассивСоответствиеДанных Цикл
//		Для каждого эл из стр Цикл
//			Описание = СоответсвиеСинонимовСвойств.Получить(list+"/"+эл.Ключ);
//			стр_н = ТаблицаСвойств.Добавить();
//			стр_н.use = Истина;
//			стр_н.name = эл.Ключ;
//			стр_н.list = list; 
//			стр_н.type = ?(Описание=Неопределено,ТипЗнч(эл.Значение),Описание.Тип); 
//			стр_н.synonim = ?(Описание=Неопределено,"",Описание.Синоним);
//		КонецЦикла;
//		Прервать;
//	КонецЦикла;
//	
//	// проставим флажки
//	СоответствиеКолонок = новый Соответствие();
//	
//	Для каждого стр из СтарыеКолонки Цикл
//		СоответствиеКолонок.Вставить(стр.Ключ,стр);
//	КонецЦикла;
//	
//	Для каждого стр из ТаблицаСвойств Цикл
//		Колонка = СоответствиеКолонок.Получить(стр.name);
//		Если Колонка=Неопределено Тогда
//			Продолжить;
//		КонецЕсли;
//		стр.use = Колонка.Видимость;
//	КонецЦикла;	
//	

//КонецПроцедуры

 &НаКлиенте
Процедура СохранитьНастройкиКолонокТекущегоСписка(Знач list)
	//Перем мНастройка;
	//Перем Ключ;
	//// Сохраним настройки
	//Ключ = "МониторRAS.Форма";
	//мНастройка = ПолучитьНастройки(Ключ, list);
	//Если мНастройка=Неопределено Тогда
	//	мНастройка = новый Структура;
	//	мНастройка.Вставить("Форма",новый Соответствие);
	//КонецЕсли;
	//
	//мНастройка.Форма.Вставить(list,новый Структура("Колонки",СтарыеКолонки));
	//
	//СохранитьНастройки(Ключ, list, мНастройка);
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройки(Ключ, list)
	Возврат	ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(Ключ, list);
КонецФункции

&НаСервере
Процедура СохранитьНастройки(Ключ, list, мНастройка)
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(Ключ, list, мНастройка);
КонецПроцедуры

&НаСервере
Функция ПолучитьСписок(мПараметры,list)
	
	ТекстОшибки = ""; 
	
	
	Ковычка = Символ(34); 
	ТекПлатформа = РегистрыСведений.зд_АктуальнаяПлатформа.ПолучитьПоследнее(ТекущаяДата()).Платформа;			
	СтрокаПлатформа = Ковычка+ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекПлатформа,"ПутьКRAC")+Ковычка; 
	СтрокаКластера = Новый УникальныйИдентификатор(мПараметры.cluster); 
	
	
	МассивКластер = СтрРазделить(мПараметры.key, ":", Ложь);
	Если МассивКластер.Количество() > 1 Тогда
		Сервер = МассивКластер[0]; 	                              
		Порт = МассивКластер[1];
		
		//Если list = "ксСеансы" Тогда
		Результат = МодульRAC.ПолучитьТаблицуСеансовНаСервере(СтрокаПлатформа,Сервер,СтрокаКластера,Порт);
			
		//ИначеЕсли list = "ксПроцессы" Тогда
		//	МодульRAC.ЗаполнитьТаблицуПроцессовНаСервере(СтрокаПлатформа,Сервер,СтрокаКластера,Порт);
		//ИначеЕсли list = "ксСоединения" Тогда
		//	МодульRAC.ЗаполнитьТаблицуСоединенийНаСервере(СтрокаПлатформа,Сервер,СтрокаКластера,Порт);
		//КонецЕсли; 
		
	КонецЕсли;
	
	Возврат Новый Структура("Результат", ОбщегоНазначения.ТаблицаЗначенийВМассив(Результат));
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьРаботуСенаса(Команда)
	
	МассивВыделенных = Новый Массив;
	Для Каждого Стр Из Элементы.ТаблицаСеансов.ВыделенныеСтроки Цикл 
		МассивВыделенных.Добавить(Стр);
	КонецЦикла;
	
	Для Каждого ТекВыд Из МассивВыделенных Цикл
		ТекущиеДанные = ТаблицаСеансов.НайтиПоИдентификатору(ТекВыд);
		мПараметры = СформироватьСтруктуруЗапроса();
		мПараметры.Вставить("session",ТекущиеДанные.session);
		СтруктураДанныхОтвета = ЗавершитьРаботуСенасаНаСервере(мПараметры); 
		ТаблицаСеансов.Удалить(ТекущиеДанные);
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗавершитьРаботуСенасаНаСервере(мПараметры)  
	Результат = "";
	Ковычка = Символ(34); 
	ТекПлатформа = РегистрыСведений.зд_АктуальнаяПлатформа.ПолучитьПоследнее(ТекущаяДата()).Платформа;			
	СтрокаПлатформа = Ковычка+ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекПлатформа,"ПутьКRAC")+Ковычка; 
	СтрокаКластера = Новый УникальныйИдентификатор(мПараметры.cluster); 
	МассивКластер = СтрРазделить(мПараметры.key, ":", Ложь);  
	Если МассивКластер.Количество() > 1 Тогда
		Сервер = МассивКластер[0]; 	                              
		Порт = МассивКластер[1];	
		МодульRAC.ЗавершитьСеансНаСервере(СтрокаПлатформа,Сервер,Порт,СтрокаКластера,мПараметры.session,Результат);
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура КластерПриИзменении(Элемент)
	
	мПараметры = СформироватьСтруктуруЗапроса();
	ЗаполнитьСписокИБ(мПараметры);

	СформироватьСписокНаКлиенте(Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформационнаяБазаПриИзменении(Элемент)
	Элементы.ТаблицаСеансов.ОтборСтрок = Новый ФиксированнаяСтруктура("infobase",ИнформационнаяБаза);
КонецПроцедуры

&НаКлиенте
Процедура ИнформационнаяБазаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	Для каждого лкСтр Из Элементы.ИнформационнаяБаза.СписокВыбора Цикл
		Если СтрНайти(лкСтр.Представление,Текст) > 0 Тогда
			ДанныеВыбора.Добавить(лкСтр.Значение,лкСтр.Представление);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СписокБазНаСервере(мПараметры)
	
	Ковычка = Символ(34); 
	ТекПлатформа = РегистрыСведений.зд_АктуальнаяПлатформа.ПолучитьПоследнее(ТекущаяДата()).Платформа;			
	СтрокаПлатформа = Ковычка+ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекПлатформа,"ПутьКRAC")+Ковычка; 
	СтрокаКластера = Новый УникальныйИдентификатор(мПараметры.cluster); 
	
	
	МассивКластер = СтрРазделить(мПараметры.key, ":", Ложь);
	Сервер = МассивКластер[0]; 	                              
	Порт = МассивКластер[1];
	
	Для Каждого ИБ Из МодульRAC.ПолучитьТаблицуИнформационныхБазНаСервере(СтрокаПлатформа,Сервер,СтрокаКластера,Порт) Цикл
		Если не ПустаяСтрока(ИБ.name) Тогда
			Сообщить(ИБ.name);
		КонецЕсли;		

	КонецЦикла;

	
КонецПроцедуры

&НаКлиенте
Процедура СписокБаз(Команда)

	мПараметры = СформироватьСтруктуруЗапроса();
	СписокБазНаСервере(мПараметры);

КонецПроцедуры
